tap "ankitpokhrel/jira-cli"
tap "anomalyco/tap"
tap "brew-gem/gems"
tap "gp-nova/devx-cli", "https://github.com/gp-nova/devx-cli.git"
tap "koekeishiya/formulae"
tap "localstack/tap"
tap "microsoft/dev-proxy"
brew "ca-certificates"
brew "asyncapi"
brew "aws-cdk"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "brew-gem"
brew "btop"
brew "cfn-lint"
brew "check-jsonschema"
brew "cloc"
brew "cycode"
brew "docker", link: false
brew "entr"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-who"
brew "gnu-sed"
brew "go"
brew "handbrake"
brew "hurl"
brew "jq"
brew "mkdocs"
brew "newman"
brew "openapi-generator"
brew "pandoc"
brew "python@3.10"
brew "ripgrep"
brew "ruby"
brew "scrcpy"
brew "stow"
brew "tldr"
brew "zoxide"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "anomalyco/tap/opencode"
brew "brew-gem/gems/gem-cfn-nag"
cask "android-platform-tools"
cask "betterdisplay"
cask "blender"
cask "bruno"
cask "docker-desktop"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-poppins"
cask "ghostty@tip"
cask "gimp"
cask "git-credential-manager"
cask "handbrake-app"
cask "karabiner-elements"
cask "maccy"
cask "marta"
cask "mockoon"
cask "obs"
cask "postman"
cask "rectangle"
cask "ubar"
cask "ueli"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/lint/golint"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/suntong/html2md"
go "github.com/josharian/impl"
go "jgh"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/neilpa/yajsv"
